{
    "comments": [
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830972,
            "user_id": 48254247,
            "comment_title": "<br\\//>",
            "comment_body": "It appears that many on this thread are eager to defend the First Amendment's protections for a free press as long as they like the journalist and what they publish, but not if they don't.  What they don't seem to grasp is that selective defense of rights is no defense of rights at all.  What they actually defend is privilege for those who defend the political actors and policies they support and punishment for those who criticize or oppose them.  Trump would certainly approve.",
            "recommendations": 19,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829940,
            "user_id": 62938502,
            "comment_title": "<br\\//>",
            "comment_body": "Thank you James Risen.\nMany of these comments are disturbing. And in my mind extremely and dangerously foolish. In this  context who cares what they think about Assange and/or Greenwald. Particularly if they feel negatively towards them. In another context it would be more than relevant what they  think. Obviously if they liked either or both  there would be an extra level of intensity in protecting them. Because you would also be joining them for other reasons. But this  assault on them  is an assault on all of us. These people are in prison. Assange  essentially is being tortured. His health is crashing. It is not like a column of his has been dropped because a newspaper doesn't agree with him. Repressive forces always look for  a wedge as they initially start tearing away  people's rights. And not to be ferocious in our response makes us suckers of the worst kind.\nFree Glenn Greenwald! Free Chelsea Manning! Free Julian Assange!",
            "recommendations": 16,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104836415,
            "user_id": 57076816,
            "comment_title": "<br\\//>",
            "comment_body": "While I support freedom of the press, it is important to note that Greenwald continues to attack liberals and progressives. <a href=\"https://www.newyorker.com/magazine/2018/09/03/glenn-greenwald-the-bane-of-their-resistance\" target=\"_blank\">https://www.newyorker.com/magazine/2018/09/03/glenn-greenwald-the-bane-of-their-resistance</a>\n\nHis record of fearless reporting of corruption has this funny kink in it. Attacking allies rather than enemies does not help.\n\nHe lives with his partner in a wealthy enclave, protected from the street-level crime and endemic corruption in Brazil, so I sometimes wonder if he is able to check his privilege or keep a sense of proportion. For those who suggest he would be safer in the US, he's not here precisely because he doesn't feel safe here, with good reason.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104836075,
            "user_id": 106671000,
            "comment_title": "<br\\//>",
            "comment_body": "Journalists remain in the good books of the rulers as long as they toe the line. They will even be celebrated when they 'expose' the political or ideological opponents. But to expose the ruling elite will be to invite their wrath. Governments world over are armed with one or the other draconian law to deal with these nags and embarrassment. On the flip side, any investigative journalist charged thus should be thankful and be happy that he is alive to give a fight rather than being liquidated like Jamal Khasshogi",
            "recommendations": 5,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104833359,
            "user_id": 2073520,
            "comment_title": "<br\\//>",
            "comment_body": "\"Joel Simon, the executive director of the Committee to Protect Journalists, said in an interview that one of the latest tactics spreading around the globe is the creation of vaguely worded “fake news” laws that criminalize news that government officials deem to be wrong.\"\n\nNews that public officials \"deem to be wrong,\" not because it's factually incorrect but because it counters a blatant lie or conspiracy theory pushed by an administration. \n\nWouldn't Donald Trump just love to pass such a law.  He's probably salivating over this very agenda point for an eventual second term.  \n\nAnd once he's exacted his pound of flesh from members of his own party, what's to stop him?",
            "recommendations": 7,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104832449,
            "user_id": 25809800,
            "comment_title": "<br\\//>",
            "comment_body": "The war on whistle blowers has been going on for some time. \n\nAttacks on journalists are only an escalation of that war.\n\nGovernments (especially ours) hide behind 'National Security' to keep their own bad acts out of the light.\n\nUnfortunately you are more likely to see the media parrot propaganda than do real investigations and report the truth.\n\nAssange has been treated abysmally.  So has Manning. More press attention was focused on Manning himself than the crimes revealed in what he released.",
            "recommendations": 7,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829115,
            "user_id": 66504280,
            "comment_title": "<br\\//>",
            "comment_body": "We don’t need to go to other countries to witness this: e.g. Mary Louise Kelly and Mike Pompeo.  The more autocratic our government becomes, the less tolerant it is of journalists who ask the questions that need to be asked.",
            "recommendations": 142,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104837319,
            "user_id": 41815993,
            "comment_title": "<br\\//>",
            "comment_body": "The rancor here from many posters against Assange is disheartening.\n\nWhether he’s a “journalist,” a “publisher,” or even just a “hacker” is unimportant.\n\nHe exposed the truth that we have a right to know.\n\nAnd make no mistake: the US government is prosecuting him as a specific warning to journalists: keep your nose out of our corruption and coverups.\n\nEvery media outlet in America should be leaping to his defense, including this paper. \n\nThey’ll be next.",
            "recommendations": 10,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831584,
            "user_id": 14530169,
            "comment_title": "<br\\//>",
            "comment_body": "Is Glenn getting any help from the American Embassy down there or has big Mike Pompeo ordered Bolsonaro to waterboard him to get him to disclose dirt on Biden?",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831750,
            "user_id": 59503643,
            "comment_title": "<br\\//>",
            "comment_body": "Fake news is fake news made up by the guy in the White House.",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104836282,
            "user_id": 88129405,
            "comment_title": "<br\\//>",
            "comment_body": "As if the world was not cruddy enough Brazil had to elect another right wing extremist wack job. I have been going to Brazil for over 25 years but will not go back until Jair Bolsonaro is out of office. He of course is in love with Trump as Trump loves Putin. Birds of a feather meal up together. They all hate a free press, intellectuals and artists as those people let us know of their dirty murderous deeds. Bolsonaro wants to being back a dictatorship to Brazil..His quote about why the last dictatorship in Brazil failed \"We did not kill enough people\"....Is this the world you want to live in?",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104836808,
            "user_id": 69803653,
            "comment_title": "<br\\//>",
            "comment_body": "If you and your ilk had been around in 1944 you would have thought it proper to publish the plans for the D-Day invasion under the guise of people need to know.",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831543,
            "user_id": 5306343,
            "comment_title": "<br\\//>",
            "comment_body": "It seems pretty easy to be an ethical journalist.  Don't help your sources steal data and you should be OK.  It's far easier to defend what Snowden and Greenwald did then it is to defend Manning and Assange.",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104837674,
            "user_id": 60009840,
            "comment_title": "<br\\//>",
            "comment_body": "The truth faces a threat from the reporters.\nHere is the latest proof.\nYesterday nine people died in a helicopter crash in L.A.\nHowever if you followed the media outlets, you would think that only one or two of them mattered.\nThat's what the corporate profitability does to our sense of humanity....",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104837025,
            "user_id": 68218751,
            "comment_title": "<br\\//>",
            "comment_body": "If only American journalists would cover American government without their preconceived bias and with a goal of reporting the whole truth, we would all be better off.",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831560,
            "user_id": 6815766,
            "comment_title": "<br\\//>",
            "comment_body": "At least the worst thing that happens to a reporter in the US is that they get yelled at - with profanity even!",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104836924,
            "user_id": 78689168,
            "comment_title": "<br\\//>",
            "comment_body": "I call upon the NYT editorial board to express unequivocal solidarity with Greenwald, Assange and any other journalist facing similar circumstances. Journalism is under attack - and by extension so is democracy.",
            "recommendations": 2,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104841028,
            "user_id": 72639788,
            "comment_title": "<br\\//>",
            "comment_body": "I never expected my country to tolerate the truth being called fake.  The incessant lies, even denying what is on film, makes your mind feel  like it suffered an electric shock and fell into a hole with Alice in Wonderland. Strange looking people scurrying around, one not knowing what the other said, all feeling important and irreplaceable. Mnunchin, Barr, Ross, Trump, McConnell, Jordon, Grassley,  Graham, Pompeo the characters in the Wind and the Willows are more competent and better looking. \nI can't help but apply animal traits to the bunch Toady, Manatee, Hyena, Turtle, and Giraffe, Ivanka can't help the fact her neck is too long.",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831961,
            "user_id": 81766355,
            "comment_title": "<br\\//>",
            "comment_body": "We should all don hats emblazoned with “Enemy of the People”",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830419,
            "user_id": 51878992,
            "comment_title": "<br\\//>",
            "comment_body": "The sickest part of this development is that is the radical authoritarian right-wing that sponsors, propagates 'fake news' and now apparently is legislating laws against 'fake news' which often turns out to be inconvenient facts, truth and reality.\n\nTrump surfed the waves of the Birther Lie to the Presidency, which was one of the most disgraceful categorical lies in American history; and Trump has followed that Big Lie with thousands of other Big Lies to drive America over a gaslighting cliff.\n\nIf there is one fundamental family value of the radical right, it is hypocrisy and Grand Old Projection, blaming others for what they are most guilty of....in this case, fake news.\n\nThe radical right has consistently rejected science, facts, economics, truth and reality in favor of fraud, fiction, fantasy and fake reality.\n\nIf you think the right wing is good for anything except power, greed and destruction, you haven't been paying attention.\n\nWake up world, the grim right-wing reapers would like nothing more than to murder the truth.\n\nVote accordingly.",
            "recommendations": 66,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831780,
            "user_id": 15876855,
            "comment_title": "<br\\//>",
            "comment_body": "considering the fact that the Republican Party is on the verge of turning America into a Donald Trump dictatorship, and his latest demand is for Paul Krugman to be fired as the king is displeased, journalists should be worried, since one of the two major parties has blessed the trump autocracies, andhas given up any presence of defending the US Constitution and the country in favor of defending the first president to have not read the US Constitution.",
            "recommendations": 5,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104834999,
            "user_id": 69024476,
            "comment_title": "<br\\//>",
            "comment_body": "Julian Assange should be free. I will agree that he is not a journalist but he provided fodder for journalists which they themselves failed to find. In short Assange did the work for journalists and found indisputable truth.",
            "recommendations": 4,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104837074,
            "user_id": 34004821,
            "comment_title": "<br\\//>",
            "comment_body": "The parallels to the Assange case are unmistakable. Right-wing authoritarian quasi-fascist governments attempting to silence the press by arresting journalist or the publishers of those journalists or whistle blowers who reveal criminal activity or unconstitutional activity by our government officials for printing leaked information given to them by a third party is evidence of wrong doing. It has gotten so bad that even the Obama administration went after whistle blowers and the journalist who worked with them, using the 1918 Espionage  Act more time than all previous presidents combined. Gee, I wonder where Trump got his idea that he could attack the press?\nThe lack of outrage, particularly by American journalists and news outlets, about the treatment and persecution of Assange who revealed war crimes and other unsavory things about our government and its officials, really set the stage for this. Why should other governments respect the press when our own press  doesn't even care. This newspaper is one of the more shocking examples of the apathy towards Assange, You would think that a paper that published the Pentagon Papers would be leading the charge. The corporate takeover of the mainstream news outlets is basically complete. Now, they will move on to silence the independent journalists on other platforms a like Youtube, saying, of course, that it is \"fake\" news (sound familiar?), or drum up unsupported charges like they did with the Grayzone editor Max Blumenthal.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104832709,
            "user_id": 49974062,
            "comment_title": "<br\\//>",
            "comment_body": "Neither Glenn Greenwald nor Julian Assange is “strange” or “disagreeable”.  When it comes to exposing government corruption and abuses, the Malcolm X Doctrine applies:\n\nBy any means necessary.",
            "recommendations": 3,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104836529,
            "user_id": 62222075,
            "comment_title": "<br\\//>",
            "comment_body": "From his first press conference as POTUS in January 2017 when Trump refused questions from selected journalists, to his tweeting of a video in July 2017, in which he is shown wrestling and punching a man whose head has been replaced with the logo of CNN, to his revoking of White House press passes from dozens of mainstream reporters whose coverage does not please him, and his tepid response to the murder of Washington Post reporter Jamal Khashoggi, Trump has made it clear that a “free press” will always be a thorn in his side. It will only get worse the longer he stays in power. “Democracy dies in darkness” can not be repeated enough.",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104833798,
            "user_id": 60009840,
            "comment_title": "<br\\//>",
            "comment_body": "The worst problem is not when the government lies.\nThe worst is when we lie.\nwhy?\nThere are so many of us that the lies grow with geometric progression.\nWho did start the lying first?\nUs or the government?\nThe fairy tale that we are good and the government bad isn't real.\nIf it were so, we would have stopped them many decades ago...",
            "recommendations": 2,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831510,
            "user_id": 77989479,
            "comment_title": "<br\\//>",
            "comment_body": "From the article “that journalism can be proved to be a crime through a focus on interactions between reporters and their sources.”  Two things then;  Firstly, Trump is hands down guilty and Second this a tactic by Trump and his minions so that only they can control what is reported about the government.",
            "recommendations": 2,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104837005,
            "user_id": 11596140,
            "comment_title": "<br\\//>",
            "comment_body": "Bolsonaro says and does things that are so similar to what Trump does and says I often wonder if it is intentional monkey-see-monkey-do, or if there is something in the autocrats'  DNA that makes them do anti-democratic things spontaneously.  Greenwald, who I do not particularly admire because he's something of a showboat and apparently shows no humility, believes it's intentional.  Probably.  Even if I do not care for Greenwald's public demeanor, it is simply criminal that he is being made a target for the vast anti-democratic forces here in Brazil. If Trump and Bolsonaro had any intellectual or moral stock, which they do not, they would buttress their belief in a free press and stop disseminating falsehoods themselves.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104833612,
            "user_id": 60009840,
            "comment_title": "<br\\//>",
            "comment_body": "I really cannot take the free press seriously in spite of wanting to love them.\n\nOne has to be blind to act in the way the journalists do.\n\nIf you just glanced at any newspaper, media outlet, cable channel, web site or radio station, you would be buried alive by the colossal amount of brainwashing commercials targeting your mind and all other senses.\n\nCan you imagine the tragic consequences affecting the mental health especially of the toddlers, children and teenagers?\n\nThe epidemic drug addiction, binge drinking, obesity, anxieties, fears, psychological traumas and many other addictions are the direct consequences of those deceptive and misleading ads.\n\nAs long as the journalists don’t raise their voices nothing will change…",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104841094,
            "user_id": 66995758,
            "comment_title": "<br\\//>",
            "comment_body": "If Assange is a \"journalist\" who is entitled to publish all documents that come into his possession that means that all classified/secret government documents can be published by anyone with the same journalist's privilege.  Merely dumping top secret documents into the public domain without redaction, commentary, etc. doesn't seem to be journalism no matter what laudable public service it might constitute.  If such a definition is adopted then one might as well scrap all laws limiting disclosure of classified/secret government documents.  And although most of us want government transparency there is a need to maintain some information as classified/secret.",
            "recommendations": 0,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104840398,
            "user_id": 68890766,
            "comment_title": "<br\\//>",
            "comment_body": "Greenwald's persecution from an openly right wing government of a country whose democracy is fragile is unfortunately all too common. But the persecution of Julian Assange by our own government should give everyone deep concerns.\n\nAssange has admittedly embarrassed the United States with his publication of \"secret\" material. But while the government has focused on the classified nature of the material, they've ignored the substance.\n\nBoth Democratic and Republican administrations have committed war crimes, assassinations, warrantless surveillance of American citizens, phone taps on UN officials and foreign heads of state and a host of other offenses.\n\nIn a true democracy the response should have been to keep these egregious wrongs from ever being committed again.\n\nBut our reposes has been to double down on \"national security classifications\" hunting down journalists as if they were foreign spies.\n\nOur government has no problem releasing classified information secretly to plant news stories. But when material is released by whistleblowers about government lying and misconduct they bring the hammer down.\n\nWith Assange, they basically hoped that he would die from harsh prison conditions before he would even have a chance to stand trial.\n\nThe First Amendment is hanging by a thread. If that thread breaks it will be the end of what we have left of our democracy.",
            "recommendations": 9,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104838069,
            "user_id": 60009840,
            "comment_title": "<br\\//>",
            "comment_body": "Let's see what our political bias does to our ability to correctly comprehend the truth.\n\nThe Democratic Party allegedly works on behalf of the American people.\n\nKremlin wanted to help the fellow Americans appreciate more how much the Dems sacrifice on our behalf so it publicized the emails documenting those efforts.\n\nOur investigative reporters concluded that Moscow tried to influence our elections.\n\nNo, only the Dems tried to influence the 2016 elections.\n\nKremlin only helped us learn the truth.\n\nIt means we should reciprocate identically. \n\nInstead of blaming Moscow the US government should help the Russian people learn what Kremlin is doing behind the closed doors on their behalf.\n\nIsn't the truth in everybody's best interest?\n\nCould the truth ever be a crime?",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104837755,
            "user_id": 60009840,
            "comment_title": "<br\\//>",
            "comment_body": "Show me a single investigative reporter and I will be truly be shocked.\n\nHas anybody been investigating the colossal harm inflicted upon the mental health of our children by the compiled debilitating ads created by the major corporations to maximize their profitability.\n\nIt is really hard not to notice those commercials. The reporter articles and investigations were chopped up and mixed with those ads to make them more toxic and unavoidable...",
            "recommendations": 2,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104835239,
            "user_id": 31633759,
            "comment_title": "<br\\//>",
            "comment_body": "\"...virtually every investigative reporter will become vulnerable to criminal charges and imprisonment.\"\n\nFake news.   There are no criminal charges unless a reporter knowingly leaks top secret information, in which case I hope they are prosecuted.",
            "recommendations": 0,
            "reply_count": 3
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104833673,
            "user_id": 22502625,
            "comment_title": "<br\\//>",
            "comment_body": "Whatever happened to our core principal, Prior Restraint? Without it Daniel Ellsberg, and others, would never have been able to legitimately provide us with evidence of government lies . Without it freedom of the press, and of speech, would become historical curiosities.",
            "recommendations": 18,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104833404,
            "user_id": 60009840,
            "comment_title": "<br\\//>",
            "comment_body": "The worst threat to the journalism comes from the journalists.\n\nThey are working for the corporations controlled by the global business conglomerates.\n\nThe truth and profitability don't mix well.\n\nActually, two of them don't mix at all. At this moment in history, the colossal profitability comes at the expense of the truth.\n\nSince the governments are controlled by the same corporations, there is no conflict of interest between the governments and free press.\n\nBoth of them are the faitful servants of their masters.",
            "recommendations": 7,
            "reply_count": 2
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104832649,
            "user_id": 91605035,
            "comment_title": "<br\\//>",
            "comment_body": "Power corrupts. It strikes down anyone that opposes it, even on the smallest things. It despises transparency. Transparency is seen to have its own agenda that is in opposition. Unfortunately, we live in interesting times, as to how power operates on those opposed to even one part of its agenda.",
            "recommendations": 10,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104832560,
            "user_id": 99931450,
            "comment_title": "<br\\//>",
            "comment_body": "The Founders made a devil's bargain when they wrote their government's blueprint. The \"safeguards\" that they put in their blueprint to constrain their creature didn't prevent its Alien and Sedition Act, its internment of Japanese Americans in concentration camps, McCarthyism and the HUAAC, its nuking of children, nor its droning of innocent people.\nEven with the First Amendment, it is violating freedom of the press with the Assange case, as well as its electronic spying.\nAlthough their blueprint says \"secure in their persons, houses, papers, and effects\", people are turning to encryption for safety.\nA danger we face is that we still don't know which encryption programs the government has surreptitiously hacked. Government's evil records shows that it can never be trusted to respect the rights to which we are all entitled. Anyone telling you otherwise is gas-lighting.\nThis problem is worsened by the vast inequality of power between the rulers and the people, especially if the people are divided. We see that with Clinton's fans antagonistic toward journalist Assange, thus failing to demand his freedom when it could have made a difference.\nThus, government takes advantage. \nWhile more than a hundred thousand people are dying every year from preventable deaths from global heating, by far the crucial problem of this century, government is hindering solving global heating.\nThe Founders' devil's bargain shows their great hubris -- their unwarranted and misplaced faith in government.",
            "recommendations": 8,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831507,
            "user_id": 54096383,
            "comment_title": "<br\\//>",
            "comment_body": "There is a journalist in prison in Indonesia, I read about on Democracy Now’s site. He was reporting on corruption and environmental destruction as well. The right wing takeover is to make sure the resources are extracted and no environmental regulations remain. The battle against the press is a battle against the survival of the diversity of life on earth and the aboriginal people in Brazil who are being forced off their land. \n\nTrump is making sure to destroy any and all environmental protection here that he can. If you are voting republican/ right wing you are voting against life. It’s that simple. No amount of money can be worth this.",
            "recommendations": 43,
            "reply_count": 2
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831443,
            "user_id": 34055417,
            "comment_title": "<br\\//>",
            "comment_body": "As a former NYC journalist (Reuters), I still think of myself as a reporter. What happened to Glen Greenwald was terrible, and it typifies \nthe state of journalism today. The fracas with the NPR reporter and Mike Pompeo is yet another troubling sign.\n\nHowever, I don’t consider Julian Assange to be a journalist. Anybody can steal classified government secrets and dump the whole thing online (a gross exaggeration to be sure), without putting the material in context.",
            "recommendations": 19,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831469,
            "user_id": 76574671,
            "comment_title": "<br\\//>",
            "comment_body": "I don’t consider Assange to be a journalist; he’s just a bitter man with computer skills and a personal vendetta.\nGreenwald is definitely a few rungs up the ladder from Assange, though I certainly didn’t agree with his “journalistic” take on everything.\nI do have concerns that failing to protect press freedoms, for the likes of Assange and Greenwald, will crack the door open for further erosion of freedoms for those considered mainstream and/or not deemed divisive journalists.",
            "recommendations": 10,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831458,
            "user_id": 61801245,
            "comment_title": "<br\\//>",
            "comment_body": "Pompeo’ s attack on NPR’s Mary Louise Kelly is a symptom of the virus that Trump has spawned.  This global contagion will be difficult to stop.",
            "recommendations": 39,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831384,
            "user_id": 61822061,
            "comment_title": "<br\\//>",
            "comment_body": "Mr. Risen highlights a major issue that should be of concern to citizens,  advocates for civil liberties, journalist and those who value democracy in general.  Press freedoms and access to information not censored or approved by officials of the State  is all that gives American citizens a semblance of control over government.  \n\nSince before becoming President , Trump has attacked the press as \"enemies of the people\".  Those paying attention will recognize this as the archetypal behavior of dictatorial autocrats, throughout history and in the world today.  One has to look no further than Putin in Russia, Erdogan in Turkey, and countless other regimes claiming to be democratized  to see this strategy at work.\n\nOnce the Free Press is successfully opressed, it is difficult if not impossible for the people to hold government accountable.  That is why in countries with State controlled media, the government is all powerful and the people are really no more than subjects.",
            "recommendations": 25,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831178,
            "user_id": 75871903,
            "comment_title": "<br\\//>",
            "comment_body": "I have a lot of respect for Glen Glenn Greenwald, but none whatsoever for Julian Assange. WikiLeaks went way beyond journalism by interfering with the 2016 election, and then they continued to try to win favor with the Trumps after the election by trying to convince Donald Trump Jr to convince his Daddy to appoint Assange to be Australia's ambassador to the US. This 2017 article from the Atlantic describes the emails they kept sending Don Jr in the hopes of extracting information in exchange for a political appointment for Assange:\n<a href=\"https://www.theatlantic.com/politics/archive/2017/11/the-secret-correspondence-between-donald-trump-jr-and-wikileaks/545738\" target=\"_blank\">https://www.theatlantic.com/politics/archive/2017/11/the-secret-correspondence-between-donald-trump-jr-and-wikileaks/545738</a>/",
            "recommendations": 8,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831179,
            "user_id": 51732188,
            "comment_title": "<br\\//>",
            "comment_body": "A global attack on investigative reporting protects the guilty and feeds Fake news to the gullible.",
            "recommendations": 21,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830902,
            "user_id": 16771238,
            "comment_title": "<br\\//>",
            "comment_body": "January 26, 2020\n\nAs always  the truth will keep us free - as is the bravery of the world journalism so goes the best in world knowledge to live for and hopefully not having to be killed.  We all -the world are only as good as journalist - thank to living hope and faith in doing the right in all.",
            "recommendations": 9,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104831042,
            "user_id": 47096394,
            "comment_title": "<br\\//>",
            "comment_body": "Yes, there are checks and balances within the traditional journalist institutions, such as the New York Times. Like our country, they have made mistakes but in my opinion they strive to be better. I’m all for a free flow of criticism of the media. Trump and his cronies, though, expect loyalty and are vengeful when his good image is not there for him to see. If the truth, as in thy shall not lie, was respected as the commandment that it is, our democracy has a chance to stay on the path of betterment. It begins with faith and love for the truth. Houston, we have a problem.",
            "recommendations": 10,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830454,
            "user_id": 68054370,
            "comment_title": "<br\\//>",
            "comment_body": "Alan Rusbridger, former editor-in-chief at the Guardian, not a Julian Assange fan, summed up the need for solidarity in this article:\n\n\"US efforts to jail Assange for espionage are a grave threat to a free media\"\n<a href=\"https://www.theguardian.com/commentisfree/2019/may/26/prosecuting-julian-assange-for-espionage-poses-danger-freedom-of-press\" target=\"_blank\">https://www.theguardian.com/commentisfree/2019/may/26/prosecuting-julian-assange-for-espionage-poses-danger-freedom-of-press</a>",
            "recommendations": 18,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829777,
            "user_id": 81187866,
            "comment_title": "<br\\//>",
            "comment_body": "Assange was not and is not a reporter.",
            "recommendations": 8,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830400,
            "user_id": 6967505,
            "comment_title": "<br\\//>",
            "comment_body": "A \"journalist\", and a leading lefty critic of Obama/Hillary who has been a regular guest on Fox News programs, both of whom derided those who exposed Russian interference helping Trump in 2016, are now alarmed about the personal impacts of Trump's attacks on the press?  Shocking...",
            "recommendations": 6,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828479,
            "user_id": 50614745,
            "comment_title": "<br\\//>",
            "comment_body": "Julian Assange is NOT  a journalist.  He is a right-wing anarchist and saboteur.",
            "recommendations": 9,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830802,
            "user_id": 35643579,
            "comment_title": "<br\\//>",
            "comment_body": "Its everybody , hasn't paid the price yet,' 'take her out.' Mimicking of people with disabilities , admitting to assaulting women, oh I  forgot that was locker room... Reveling in such complete immunity that he could kill anyone on fifth avenue with impunity ... Our president is a rude Bully. Enablers will win their nominations but they will lose in the long run.  Color me orange because I care.",
            "recommendations": 5,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828880,
            "user_id": 54019660,
            "comment_title": "<br\\//>",
            "comment_body": "Greenwald is a great reporter and fights (literally, and live on air) for what is right. Yes, the Lula prosecution was flawed.\n\nBut...Lula really is corrupt, and the PT really is a quasi-criminal organization. \n\nAnd we have the PT’s decade-long rule to thank for today’s wannabe-fascist Bolsonaro regime.",
            "recommendations": 4,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830669,
            "user_id": 77989539,
            "comment_title": "<br\\//>",
            "comment_body": "Mr. Risen should be more concerned about threats and acts of violence against reporters in Honduras, El Salvador, Guatemala, Mexico, Russia and the Palestinian Authority, to name only the most flagrant killers.",
            "recommendations": 2,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829828,
            "user_id": 19850853,
            "comment_title": "<br\\//>",
            "comment_body": "1. Julian Assange is not a reporter.\n\n2. I've written before in these comments sections that Republicans will be sending journalists to jail.",
            "recommendations": 7,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829706,
            "user_id": 71615750,
            "comment_title": "<br\\//>",
            "comment_body": "In so many ways, the Trump administration has a corrupting influence around the world, lowering democratic standards. As Trump admires Putin, Bolsonaro (a thug) admires Trump. But authoritarians in many quarters feel emboldened.",
            "recommendations": 22,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829873,
            "user_id": 75815460,
            "comment_title": "<br\\//>",
            "comment_body": "Wow.  Julian Assange is now a journalist?  Because I haven't seen his dispassionate releases of information concerning, or exposing, Trump's right wing bros in the US.  \n\nAssange is not a \"journalist\".  He was, and is, a toxic gossip columnist.",
            "recommendations": 8,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830543,
            "user_id": 83053446,
            "comment_title": "<br\\//>",
            "comment_body": "You are as non violent as I am, but please consider, for a moment if you will, that radical people with agendas who trumpet non violence and civility often go right to the edge in of violence in words they use against people, knowing full well they'll never, ever be called to task for their words or the harm they cause. They act as if in a forever bubble of security. See Mike Pompous and his attacks on NPR for reference.\n\nWere I to know for a fact I'd never be called to task for the words I use, I'd be Dr. Gonzo's proverbial 300 pound Samoan attack attorney, knowing full well no one ever would poke me in the face for the language I use. (And, evidence is that didn't work out well for Oscar.)\n\nCome to think of it, that's an apt analogy for the secretary of state, a 300 pound verbal attack gorilla. Only thing he's forgotten is that he's old, slow, fat, way out of shape, can't move, and is not going to have security for the rest of his life. He's going to get spit out into the great wide open land of PUBLIC we all live in, and some civil gent is going to slap him across his fat chops publicly and ask him if he wants to step outside to settle it man to man. \n\nDr. Hunter Thompson would rise from the dead to referee that one. Get out of line with me or mine, please, will you?",
            "recommendations": 6,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830409,
            "user_id": 29823394,
            "comment_title": "<br\\//>",
            "comment_body": "To call Assange a \"journalist,\" is absurd. He simply and literally dumped thousands of sensitive documents on his web site, Wiki Leaks.",
            "recommendations": 2,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830876,
            "user_id": 90849321,
            "comment_title": "<br\\//>",
            "comment_body": "The press needs to fight back - no more coverage of Trump. NPR should bring criminal charges against Pompeo for abuse. He brought her to a room to try to intimidate her. No better the Harvey Weinstein. Stop playing nice while you are being verbally waterboarded.",
            "recommendations": 24,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828307,
            "user_id": 67208425,
            "comment_title": "<br\\//>",
            "comment_body": "And now let’s add NPR’s Mary Louise Kelly!",
            "recommendations": 7,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828948,
            "user_id": 85435430,
            "comment_title": "<br\\//>",
            "comment_body": "It's the Republican \"New World Order\".",
            "recommendations": 10,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828959,
            "user_id": 68121786,
            "comment_title": "<br\\//>",
            "comment_body": "And we must not forget Pompeo’s vicious attack on NPR reporter, Mary Louise Kelly. Why do we tolerate these spoiled man babies in our government?",
            "recommendations": 19,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829306,
            "user_id": 334860,
            "comment_title": "<br\\//>",
            "comment_body": "It has always been a crime to access computer systems to retrieve data via unauthorized methods.  Assange made the mistake with Manning by not having Manning retrieve the info and give to him as he did with Snowden.  Snowden is the criminal and Assange is just publishing info from a criminal.  Manning told Assange how to enter the system and he allegedly retrieved the data himself.  Very, very stupid move on his part.",
            "recommendations": 0,
            "reply_count": 3
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829373,
            "user_id": 63586475,
            "comment_title": "<br\\//>",
            "comment_body": ".....and Pompeo? Mary Louise",
            "recommendations": 7,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830830,
            "user_id": 90849321,
            "comment_title": "<br\\//>",
            "comment_body": "Lead by Trump! Pompeo’s attack on a NPR reporter should result in a criminal charge. This was not in public but in a private room. This abuse of power reminds me of Weinstein- big men intimidating women. Cowardly, revolting, and vindictive. I would press charges.",
            "recommendations": 17,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830178,
            "user_id": 63300755,
            "comment_title": "<br\\//>",
            "comment_body": "How is Assange considered a journalist? Can those doing espionage for a foreign government use journalism as a disguise to hide their true identity?",
            "recommendations": 2,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830283,
            "user_id": 65349518,
            "comment_title": "<br\\//>",
            "comment_body": "To protect his profession, Greenwald should never have left the U.S.\n\nHe should have stayed and faced his original accusers in the Obama administration.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829926,
            "user_id": 135450,
            "comment_title": "<br\\//>",
            "comment_body": "This Disguised Global Crony Capitalist Empire desperately wants to silence the knowledgeable progressive vanguard, like Assange, Greenwald, Hedges, Zeese, et. al. who fully understand and will expose both Emperor Trump and this Empire in a 2020 people's peaceful and complete Second American \"Political/economic & social Revolution Against Empire\" --- just as Thomas Paine and Patrick Henry did in our first \"Revolution Against Empire\" [Justin du Rivage] against the nearly global British Empire 244 years ago.",
            "recommendations": 4,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830081,
            "user_id": 81000768,
            "comment_title": "<br\\//>",
            "comment_body": "The Intercept is funded by Pierre Omidyar, a Silicon Valley billionaire immigrant of Iranian ancestry. Other than exposing the identities of multiple whistleblowers (Reality Winner, John Kiriakou, Joseph Hickman, etc.), it’s just an expensive megaphone for the Greenwald–Assange crusade against liberal democracy. I reserve my sympathy for real journalists trying to effect real change, not a crypto-libertarian Fox pundit who uses his millions to indulge his much younger husband’s political careerism while he watches the world burn from the safety of the former investment banker estate he purchased in one of Rio’s ultra exclusive, hillside gated neighborhoods.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829490,
            "user_id": 64228011,
            "comment_title": "<br\\//>",
            "comment_body": "Sure looking like the Pompeyo/Kelly interview was a set up. To say the least, a hard question sends the Secretary of State off the rails? Incredible. For Pompeyo so quickly to abandon his level of professionalism is indeed telling that he wanted the results of an interview gone south. Oh, by the way - he claims that a person, who has a degree in European studies, does NOT know where Ukraine is? Ridiculous- He makes such an excellent victim. How can he ever withstand the constraints of negotiations with other professionals from other countries. Also, how convenient to have a map without the names of countries on it. \"Hey, boss, just happen to have one on my desk.\" says the ever efficient aide.",
            "recommendations": 11,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830915,
            "user_id": 60487893,
            "comment_title": "<br\\//>",
            "comment_body": "How far is the distance between the Bolsanaro's administration's treatment of Glen Greenwald and the Trump administration's treatment of Mary Louise Kelly?  Mike Pompeo, Secretary of State, issued lies and insults against Kelly, a respected NPR reporter, on letterhead stationary for the U.S. government. Considering his position, doesn't he have any larger matters to concern himself with?\n\nActually, it seems not. The consolidation of power through intimidation and lies seems to be the business of today's Republican party.\n\nAs someone with a son living in Bolsanaro's Brazil, I can say that as he and I compare notes, the comparisons are getting more ominous every day.",
            "recommendations": 13,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830889,
            "user_id": 70489704,
            "comment_title": "<br\\//>",
            "comment_body": "Neither Manning nor Assange are journalists. Contrast their behavior with that of the journalists who published the Pentagon Papers and reported Watergate. I have no sympathy for Assange. I will be happy to donate to help with Greenwald’s defense.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829695,
            "user_id": 63423891,
            "comment_title": "<br\\//>",
            "comment_body": "What is a reporter? Unlike an MD, lawyer, electrician, or plumber, there is no examination and there is no body that requires standards and confers recognition.  If I write a blog, am I a reporter? If I write an article of expose or intend to writer an article of expose, am I a reporter. Am I a writer or.  journalist merely because I say that I am? Who is to say that I am or am not? Clearly I have the right to freedom of speech, but how does one acquire the status of a writer or journalist. Or put another way, why should a writer or journalist have special status? For my opinion, Assange is neither a writer nor a journalist. But that is only my opinion.",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829863,
            "user_id": 52820830,
            "comment_title": "<br\\//>",
            "comment_body": "Democrats and Republican Presidents followed the same pattern in how they treated Assange and Snowden.  So  where can the press go ... when both sides are shutting down whistleblowers?",
            "recommendations": 6,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830410,
            "user_id": 53701448,
            "comment_title": "<br\\//>",
            "comment_body": "The march to Trump's dictatorship continues as I read Stable Genius \" this fascist approach to govt started with Trump's concept of govt carried over from his sole rule of the Trump Organization. Trump was never to be questioned as he was proposing one illegal action after another ,the adults in the room are all gone now and we see Trump unchained from protocol or civil rules of discourse. Trump's video recording his dinner conversation with Len Parnas who he claims not to know shows Trump's tendency to come off as a mob boss by telling someone to take out the US ambassador based on the words of an indicted donor he claims not to know. Trump sounds unhinged and confirms his status as a pathological liar to the American people.",
            "recommendations": 6,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830432,
            "user_id": 71865973,
            "comment_title": "<br\\//>",
            "comment_body": "The so-called patriots who govern us do anything to block real patriots to save our country.",
            "recommendations": 6,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829413,
            "user_id": 84182083,
            "comment_title": "<br\\//>",
            "comment_body": "Hey, are there any cartographers out there who can speak to why Pompeo had an unmarked map at the ready in his office? Or is this a question better suited to the theater crowd?",
            "recommendations": 2,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829441,
            "user_id": 62983307,
            "comment_title": "<br\\//>",
            "comment_body": "Amazing how the same commenters are all in support of the system of checks and balances to government power but they don't want to recognize that journalism serves both to check and empower the government.",
            "recommendations": 3,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829475,
            "user_id": 63586475,
            "comment_title": "<br\\//>",
            "comment_body": "And what about Mary Louise Kelly? Pompeo may not have posed a threat of prosecution and imprisonment but his lying, malicious bullying is not merely intimidation to prevent the quest for truth but is an attempt to destroy the truth itself. What price should the likes of Pompeo pay? The architect of “Benghazi, Benghazi, Benghazi forever” must face Congressional investigation to expose his lies and mortal damage to our Democracy that his threat to the practice of journalism poses.",
            "recommendations": 9,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829641,
            "user_id": 66771657,
            "comment_title": "<br\\//>",
            "comment_body": "Trump and Bolsonaro share a love for authoritarianism.   Not only are they attacking the press writ large, but specific reporters like Greenwald and others like CNN’s Jim Acosta.  Trump periodically attacks reporters and the “fake news”.  Erdogan has jailed    journalists as well. \n\nWe understand well the value of a free press, but Julian Assange as the architect of Wikileaks in not a journalist.  Would-be “whistleblower”? Perhaps?    Journalist?  Definitely not, though he’s using it as a defense strategy .    Via Twitter this morning, Trump issued a retaliatory “threat” against Rep. Schiff, it’s what authoritarians do.  Again, how many hundreds/ thousands  of people did  Erdogan jail?",
            "recommendations": 5,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830407,
            "user_id": 60215558,
            "comment_title": "<br\\//>",
            "comment_body": "Julian Assange has never been anything but a confidence man with the possible exception of being a communist agent. \nHe has never done anything even remotely like be a reporter or journalist. Everything he does, not unlike our president Trump, is about enriching himself. He likes it even more if it is possible to do it at the expense of someone else or at least cause harm to some innocent.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830428,
            "user_id": 20295938,
            "comment_title": "<br\\//>",
            "comment_body": "Greenwald is a journalist. Assange is not. But not to worry. Trump owes Assange.",
            "recommendations": 2,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830521,
            "user_id": 48751578,
            "comment_title": "<br\\//>",
            "comment_body": "It is ironic, if not deeply hypocritical, that the government-haters inside our own regime are so quick to use their legislative and regulatory tools to short-circuit freedom of expression. \n\nSmall government? Only when it blocks the untrammeled private pursuit of the wages of insatiable greed. Otherwise? Bring it on with a sledgehammer.",
            "recommendations": 3,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830289,
            "user_id": 12390877,
            "comment_title": "<br\\//>",
            "comment_body": "\"Investigative reporting\" seems to have become an entitlement to today's journalists, something they can pursue with complete disregard for privacy and common courtesy.  It has become how you win journalistic awards, gain the respect of your fellow journalists and the big salaries that come with it.  Journalists attack the wealthy, the powerful, the police, and anyone accused (not just convicted) of any thing having to do with sex, all to expose perceived 'corruption' . . . and sell papers. \n Unfortunately this end has come to justify the means, and it is time, in my opinion, that someone closes the throttle.  If journalists wish to be perceived as professionals then they have to behave like professionals.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829555,
            "user_id": 49392951,
            "comment_title": "<br\\//>",
            "comment_body": "Press/Media freedom from government is hardly absolute and a mixed blessing--and like most Constitutional rights.\n\nFree speech has always been limited by common law--libel, slander, defamation limit content; clear/present danger and nuisance limit situation; licensing regulations limit impersonation, fraudulent advertising and incompetence.\n\nFree press/media is about speech publication.  Also limited as above. But it allows Faux News and as well as logic and evidence based journalism.  It allows godstory marketing as well as academic publication.\n\nLimiting speech and publication due to national security is the black hole--no light, no information, can escape.  The result is \"Pravda\"--government propaganda marketed as \"Truth\".  \n\nTrump knows this very well--his enemy is logic and evidence based belief.  Marketing is his god.  Thus his marketing campaign that [logic based] \"media is the enemy of the people\"--because it's his enemy.\n\nMarketing is about separating people from their money or votes--it's not about logic and evidence based belief.",
            "recommendations": 4,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830215,
            "user_id": 92481136,
            "comment_title": "<br\\//>",
            "comment_body": "I do not believe Assange was or is a journalist. While one can argue the documents he obtained with the aid of Ms Manning illuminated government policy, his involvement in the 2016 DNC hacks shows he is a partisan. Greenwald's case is different. As opposed to collaborating with a fascist government in Russia, Greenwald's reporting shined a light on a fascist government in Brazil. I do not know how he obtained his information, but if he was not directly involved in obtaining it, at least from our First Amendment laws, he would be protected.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829393,
            "user_id": 80379439,
            "comment_title": "<br\\//>",
            "comment_body": "Ummm, NO! Julian Assange is NOT a journalist. He steals private information, or encourages others to do so, then sells it to malevolent actors to advance his own status. Glen Greenwald, while more careful covering his tracks has done much the same. I actually believe both at the beginning of their adventures had idealist aspirations of reigning in gross governmental overreach, but got severely corrupted along the way, trading in stolen information, much of it top secret, for personal gain of power, fame & fortune. Le't not confuse real journalists with con men who deal with rogue actors / countries to advance their corrupted crusades. Many have been deceived by them, including many journalists who done see the line these two crossed.",
            "recommendations": 4,
            "reply_count": 2
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829474,
            "user_id": 72482698,
            "comment_title": "<br\\//>",
            "comment_body": "It‘s in my view debatable whether Trump‘s regime invented the genre or is merely bringing the US in line with other countries where dictators and tyrants run the shop.",
            "recommendations": 3,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829972,
            "user_id": 5663615,
            "comment_title": "<br\\//>",
            "comment_body": "Manning, Assange, Snowden and Greenwald unmasked crimes and duplicity of governments and politicians.  Most commenters are happy if \"unclean sources\" like Panama papers are used to the detriment of governments they despise, but are even more happy when the governments they support unleash wrath on their \"tormentors\".\n\nTruth is fine if this is truth we like.  Otherwise, shoot the messengers, or pervert legal processes to \"remove them from society\".   And intimidate others who could uncover ugly truths.",
            "recommendations": 9,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829991,
            "user_id": 58689893,
            "comment_title": "<br\\//>",
            "comment_body": "Public officials, such as US Secretary of State Pompeo, who pick fights with reporters, spread the fertilizer enhancing opportunities for prosecutions like this.  If officials can convince the public, as Pompeo and Trump do here in the States, that the act of reporting corruption by public officials, investigating allegations of public officials' corruption, or even questioning them about it, are the perceived evils behind cybercrimes, then defense lawyers will have to mount 2 distinct defenses:  one essentially rebuttal defense which argues these statutes are not designed to prevent reporting about official corruption, and a second Constitutional or First Amendment defense which shows that such official corruption reporting is lawfully protected speech with socially useful purposes.  Irrespective of what you think of any individual reporter, these prosecutions are designed to silence and as political revenge which holds, for the corrupt official, one goal:  decommissioning those, including whistleblowers, who have the guts to reveal corruption in high places.  Those who disagree need only review prosecutions the government undertook while the Vietnam War raged when prosecutions and injunctions were commenced against this newspaper's publication of the Pentagon Papers, the publication of which totally destroyed the rationale for US presence in Vietnam.  That really is what being prosecuted and enjoined: the lack of accountability and integrity of public officials' actions.",
            "recommendations": 5,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830653,
            "user_id": 73276983,
            "comment_title": "<br\\//>",
            "comment_body": "I do appreciate the New York Times which has its weaknesses but very often provides outstanding factual coverage. And its efforts are undoubtedly aided by the fact that the US has long had much better information disclosure laws than many other countries, very much including my own - Canada is far worse. That said, current trends are justifiably extremely concerning.",
            "recommendations": 2,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830686,
            "user_id": 86080871,
            "comment_title": "<br\\//>",
            "comment_body": "If I remember my history correctly during the struggle for Independence , journalists and others were charged by the King of England of conspiracy, treason, and sedition against the Crown. It was certainly true that they were in the business of fomenting revolution, but they were representing the right of the governed to representation in a Constitutional Monarchy. Their printing presses were smashed, their businesses were burned, and some were hauled away in chains. Many had bounties on their heads. The lesson from that experience should not be forgotten and is the reason we have an independent press. As we have seen from the analyses of Vietnam and Iraq, governments have a way of telling stories to fit the outcome they desire. It is up to those who would inform us to reveal falsehoods and grossly misleading statements from our government. An independent press gives us a measure of security that we would sorely miss. It is debatable that Assange is a journalist or a spy, but he deserves his day in court. It would be a gross injustice if his case were used to muzzle journalists and dissenters. It would further erode our democracy and send us further down the slippery slope to authoritarian government. Surely, no one but a despot would think that a proper way to govern. Then again, we have a wannabe despot in the White House with mindlessly loyal lieutenants in his thrall.",
            "recommendations": 3,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829766,
            "user_id": 8609956,
            "comment_title": "<br\\//>",
            "comment_body": "Sad to see Risen trot out Assange to express his concerns, when in reality Assange seems to be the poster boy for why governmental oversight and \"a crackdown\" is necessary.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830062,
            "user_id": 72677103,
            "comment_title": "<br\\//>",
            "comment_body": "We've been there before with the Pentagon Papers, and we seen regularly since that era threats to jail journalists who won't reveal their sources or turn over their notes.  We haven't seen the last of this, and the threats have escalated from jailing or being shut down to physical intimidation.  We're now in the midst of a crisis due to the attempt by Secretary Pompeo to intimidate Mary Louise Kelly at NPR.  She is not the only journalist to be singled out for recrimination or worse by the current regime in Washington.  A demagogue need not threaten incarceration or worse, he need only to dog whistle to his zealots that a journalist should be 'punished.'",
            "recommendations": 6,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829543,
            "user_id": 15981698,
            "comment_title": "<br\\//>",
            "comment_body": "Sweeping Generalities do not help promote anything, I do not know about Greenwald but Assange is not a Journalist but a business man hiding behind a title to protect himself,  Today misinformation was published about the Coronavirus and spread through social media by AntiVac's, far Right Media and AntiVac Religious Groups across many nations.  This misinformation can kill people and probably will as it has done with the Measles.  Ignorance Kills and is a challenge to free press around the world. Profiting off information like Assange, Misinformation, hacking for revenge is not the same as informing the public.  And there are crimes in publishing information.",
            "recommendations": 0,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830058,
            "user_id": 63938366,
            "comment_title": "<br\\//>",
            "comment_body": "Greenwald is an often dubious character (note the Snowden Affair) but lat east he is a journalist and has a legal background.  \n\nHe'll need a lot of luck fighting against Bolsonaro and the Brazilian justice apparatus.\n\nOn the other hand Assange deserves every bit of vitriol coming his way. He's a hacker, not a journalist, never has been and he only ever cared about his personal brand.  \nHe's also linked to the Russkies through financial backing. \nI don't think he deserves an ounce of sympathy or support.",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830837,
            "user_id": 17837112,
            "comment_title": "<br\\//>",
            "comment_body": "I'm afraid I think Assange SHOULD be prosecuted, and perhaps Greenwald (whom I equally suspect of being a Putin asset) as well. I am more concerned about Trump's threats against CNN and NPR. And since James Risen speaks ONLY about two \"journalists\" I believe are under Russian control, I suspect the same of him.",
            "recommendations": 0,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830792,
            "user_id": 77318983,
            "comment_title": "<br\\//>",
            "comment_body": "On a general note, many politicians and a number of their voters seem to have forgotten that the primary function of the press in a democracy is to ask the hard questions on behalf of the public - in short, a free and functional press is necessary for an informed electorate. In our country it’s part of the equation - along with the three separate branches of government - that provides the balance so necessary to keep our form of government functional.  Taking that balance away is a recipe for disaster and we are teetering in the edge of imbalance already.  Politicians - no matter where they are or what their ideology is - attack the press when it gets too close to uncovering what they want to hide.    The press isn’t the enemy of the people. At it’s best it is the enemy of corruption.  In many instances around the world it is corruption’s only enemy.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830790,
            "user_id": 95537536,
            "comment_title": "<br\\//>",
            "comment_body": "This opinion piece loses credibility by tying Julian Assange to journalism. He is not a journalist.\n\nJournalists take care with their sources and refine their published reports to protect those at risk. Neither Julian Assange nor Wikileaks did anything of the sort.\n\nOn the contrary, Wikileaks recruited whistle blowers actively (as opposed to whistle blowers seeking our journalists of their own accord. Furthermore Wikileaks and Assange provided these so-called whistle blowers with tools to engage in data theft and espionage.\n\nWhen that data was ultimately shared with Wikilieaks, the organization did not make any attempt to strip personally identifiable information about covert assets / sources deployed in dangerous hot spots around the world, therefore putting their lives at risk.\n\nThat's not journalism, responsible or otherwise.",
            "recommendations": 3,
            "reply_count": 2
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830561,
            "user_id": 67971822,
            "comment_title": "<br\\//>",
            "comment_body": "Reporters face new threats from governments they cover?\n\nI don't see why this would surprise anyone. Every field which deals with the written and spoken word has never sat well with power. And it's a deep question if such can ever sit well with power. In fact it's one of the primary questions of any age and it's almost revelatory just to state it. I doubt one in a hundred people reading these very words ever realized this problem.\n\nOn one hand you have human language, rise of literature, philosophy, scientific theories, and of course journalism. On the other power no matter how enlightened eager to operate secretly. And it's ironic that even in democratic societies we speak very seriously about guarding privacy. Actually probably not just power is fundamentally inimical to true and powerful and revelatory development of human language but the average person. \n\nIt's a serious question if language can penetrate all the veils which people put over themselves. And even in the most democratic societies all forms of the written and spoken word are as coopted as possible, with many barriers spoken and unspoken erected in front of their use. But just why is it language is always thwarted from its path of development by especially power? Is language the original weapon of mass destruction, that there must perpetually be a barrier between language and human secrets? \n\nIs it actually in the interests of human development period to have a zone of secrets forever beyond language?",
            "recommendations": 5,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830540,
            "user_id": 46936829,
            "comment_title": "<br\\//>",
            "comment_body": "As many others have said, Julian Assange is a publisher, not a journalist.  Glenn Greenwald to a very large extent is as well.  And some of the internet generation of publishers have been, to varying degrees, accessories before the fact to criminal hacking, not just fly-on-the-wall reporters of the outcomes.\n\nWe do need a line drawn, but it is really up to a functioning democratic government in deep consideration of the Constitution -- something we do not have right now -- to draw that line, not Glenn himself. Otherwise, you correct the arrogation of too much power to one person (the President, for instance) by the arrogation of too much power to another (Glenn Greenwald, for instance).\n\nI do not see how the cause of a free and justly governed public is benefitted by either dictatorial move.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830518,
            "user_id": 93039925,
            "comment_title": "<br\\//>",
            "comment_body": "The work that some journalists do has always been dangerous.  Speaking truth to power is a calling that by it's very nature invites the ire of those who often have the capacity to do harm to careers and to persons.\n\nThank you to the people who make it their calling to inform us, the American public about the workings of our government and our public servants.  Thank you to the people commenting on this article for prompting me to listen to the Kelly - Pompeo interview.  Another example of a man who has learned at the feet of the master, just make stuff up.  When called out on the lack of evidence for your claims, repeat the unsubstantiated claims and insult the reporter.  The 2020 elections are near, hopefully Mr Pompeo and his ilk will be out of a job.\n\nThis government is our government, without information, truth, we are unable to function as a democracy because we cannot hold our public servants accountable.",
            "recommendations": 5,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830408,
            "user_id": 87833786,
            "comment_title": "<br\\//>",
            "comment_body": "This crackdown on the press is so dangerous. And charging Assange under the Espionage Act, if allowed to stand, is a death sentence to bold investigative reporting. You don't have to like him, but you do have to defend him.\n\nThis case against Glen Greenwald, one of the best & most courageous investigative reporters around, must be defeated. The entire media knows what is at stake & must mobilize to defend these two, as must civil liberties activists.\n\nAlong with this repression of the press has been the weaponization of the Internet.  It is now common practice for governments to shut down the Internet as part of their attacks on mass mobilizations in their countries, e.g., Iraq.\n\nI fully expect Pres. Trump to try that here. I hope there is a secret cabal of Internet geniuses somewhere working on alternative communications to a blocked Internet.",
            "recommendations": 13,
            "reply_count": 5
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830389,
            "user_id": 6252999,
            "comment_title": "<br\\//>",
            "comment_body": "For a democracy to flourish, information about Government wrongdoing ought to come out, period. Using the criminal law to manage and regulate news gathering and dissemination can serve the interests of bullies, while trying to be \"even-handed\" so as to satisfy both poles and the middle is an exercise in futility. And given how polarized our media has become (anyone know of a \"neutral\" news source?) forget about distinguishing between \"real\" journalists and pretenders. Assange and Greenwald might not be your favored dinner guests, but both deserve medals.",
            "recommendations": 10,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830327,
            "user_id": 97342017,
            "comment_title": "<br\\//>",
            "comment_body": "The freedom of the press has to be always according to the best interest of all citizens and for this reason it is sacred and deserves all protection. It seems that it is already very clear, just by reading all the comments posted here, a certain partisan use of the press. The way both men used their rich trove of information calls the attention to the difference between a journalist fair use of his privileged position to inform, investigate and uncover the abuse of power and corruption and the political use to manipulate public opinion according to their own agenda.",
            "recommendations": 7,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104830232,
            "user_id": 40669564,
            "comment_title": "<br\\//>",
            "comment_body": "I live in Brazil and follow this carefully.   \n\nGreenwald broke Brazilian law by dint of his active encouragement of, and involvement with, criminal enterprises to hack into, and then selectively publish,  the private cell phone messages of a BRAZILIAN FEDERAL JUDGE (!)  responsible for an unprecedented anti-corruption campaign.  \n\nThis campaign ensnared former President Lula and hundreds of his government and party operatives who raided the coffers of government state-owned enterprises like Petrobras.  We're talking about a multi-billion-dollar racketeering operation.\n\nThe real victim here,  former federal Judge Moro, is a hero to us Brazilians for finally ending impunity for corrupt Brazilian elite politicians like Lula and making them accountable for their actions.\n\nLike Assange, Greenwald selectively leaked messages, only this time instead of pro-Trump, it was pro-Lula.  \n\nAnd like Lula, Greenwald has a right to his day in court.",
            "recommendations": 11,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829949,
            "user_id": 48147869,
            "comment_title": "<br\\//>",
            "comment_body": "The leading icons of journalism were once Walter Cronkite and Edward R. Murrow.  And they were widely viewed as champions of the truth.  But over time, journalism has been sullied.   \n\nIn a list of last year's Pulitzers, the first three that jumped out championed controversial causes --  gun control, MeToo and the crusade against Trump.  I am sure the reporting was outstanding, but I am also sure that those who award the Pultizers had political agendas.\n\nJournalists today almost always take sides on partisan matters, in part because there are few accepted truths, and most causes are now partisan.  When asked to identify unbiased press outlets, Americans singled out the Associated Press and not much else.\n\nBringing this on home, the media is way more partisan, way more flashy and way more mercenary than before, with fancy online sites, fancy graphics, and lots and lots of video.  Moreover, a very few sources dominate, and those that do have inordinate influence.\n\nIn short, the media is tainted. And because of the taint, including dishonored celebrities like Matt Lauer and Bill O'Reily, we bear less allegiance to journalists.  And when journalists venture into the controversial, we no longer leap to their defense.  The days of Walter Cronkite and Edward R. Murrow are over.  And, for good reason, the public has become cynical and is less likely to be swayed by journalists defending themselves as neutral arbiters who serve only the truth.",
            "recommendations": 7,
            "reply_count": 4
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829942,
            "user_id": 85432249,
            "comment_title": "<br\\//>",
            "comment_body": "I find some irony in Mr Greenwald's situation. I enjoy his appearances on \"Democracy Now\". However, in the months leading up to Trump's election, during Amy Goodman's interviews with him, he was virulently anti-Clinton. Almost misogynistic. In one interview he seemed amused at the prospect of a Trump presidency. Check the archives. Glenn Greenwald is one of the many Hillary-Haters on the left who helped Trump win.",
            "recommendations": 24,
            "reply_count": 4
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829830,
            "user_id": 37369164,
            "comment_title": "<br\\//>",
            "comment_body": "I've scanned the first few comments, all sober and reasonable. But here's the real issue: this is a disturbing trend. Men  and women of integrity have been murdered for speaking the truth. Can criminal administrations really accuse men like Assange - a man I don't admire -  and keep a straight face? As Orwell put it, \"If you want a vision of the future, imagine a boot stamping on a human face, forever\" Admittedly, we have to find a point of balance in very confused and chaotic times.",
            "recommendations": 12,
            "reply_count": 2
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829785,
            "user_id": 64672620,
            "comment_title": "<br\\//>",
            "comment_body": "When one of two major political parties has made constant lying a requisite for membership, then it's only natural that the truth and those who tell it will become the \"enemies of the state\". The way to protect members of the media is incredibly simple. Vote every Republican out of office. Unfortunately, due to their extensive and wholesale corruption of the voting process, it's easier said than done.",
            "recommendations": 51,
            "reply_count": 2
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829773,
            "user_id": 65460007,
            "comment_title": "<br\\//>",
            "comment_body": "Thank you for this important article.\n\nYet another way in which Donald Trump encourages authoritarians around the world to imprison or kill the most important people that oppose them- often journalists.\n\nThe aftermath - including unfettered climate destruction as the Amazon is turned into beef pasture - will be devastating for all of us. \n\nThis would be a more important article of impeachment than the quid pro quo in Ukraine. If Democrats cared about what matters to the rest of us.",
            "recommendations": 13,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829682,
            "user_id": 60790181,
            "comment_title": "<br\\//>",
            "comment_body": "The Justice Department did not file charges against Assange in connection with WikiLeaks' publication of DNC email because it had no evidence that Assange was involved in the hacking of DNC computer servers. However, it maintains it can prove Assange plotted with Pvt. Chelsea Manning to gain access to Department of Deference classified computer networks. The First Amendment says, Congress shall make no law abridging the freedom of thee press, but that applies to the news milia freedom to publish what it pleases. It does not give journalist investigate powers that are denied to even to law enforcement agencies. For example, the FBI would require a warrant to search computer data bases.",
            "recommendations": 7,
            "reply_count": 2
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829540,
            "user_id": 97802930,
            "comment_title": "<br\\//>",
            "comment_body": "Though like others, I would not describe Mr. Assange as a journalist as I definitely would Mr. Greenwald, my focus is more on the source of this attack on journalists worldwide. In my view, it is part of the extremism that seems to have been elected or appointed to head governments worldwide. We have an extremist at the head our Executive Branch in which many extremists of varying, but not high qualifications are appointed. Turkey and Russia have oligarchs who want to emulate the North Korean leader-for-life. Perhaps ours is thinking along those lines as he and his appointees ignore the U.S. Constitution in furtherance of their (spelled H-I-S) selfish goals.\n\nNone of these or other country heads, like the one that was elected in Brazil, want a free press asking probing, embarassing questions. Neither do their most ardent supporters. So their answer, as in the case of Mr. Greenwald, is to trump up some charge (no pun intended) in hopes of sending them to jail and try to silence them that way.\n\nOur world certainly has changed and not for the better.",
            "recommendations": 19,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829503,
            "user_id": 32631786,
            "comment_title": "<br\\//>",
            "comment_body": "I cannot equate Mr. Greenwald to Mr. Assange.  Mr. Greenwald is a journalist. Mr. Assange is more than likely a Russian spy.  I think the comparison of the two weakens the writer’s argument.  And yes, I fully support freedom of the press, but criminal activity is to no more be excused for journalists than it should be excused for cops or politicians.",
            "recommendations": 27,
            "reply_count": 4
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828872,
            "user_id": 67780436,
            "comment_title": "<br\\//>",
            "comment_body": "With all due respect, Mr. Risen conflates Glenn Greenwald with Julian Assange. Mr. Greenwald is a journalist who reported on US and UK global surveillance leaked by Edward Snowden. Mr. Assange is at best a hacker and compiler of information to be delivered to actual journalists such as Mr. Greenwald. I am grateful for defense of Mr. Greenwald. I am profoundly ambivalent about the defense of Mr. Assange as a journalist.",
            "recommendations": 43,
            "reply_count": 6
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828922,
            "user_id": 85435430,
            "comment_title": "<br\\//>",
            "comment_body": "Reverse engineer this; It's government obedient television pitted against the free press. Trump is an actor. Television is government friendly. It's the most widespread messaging there is with a mesmerizing screen that is indelibly received by the brain. The government owns our minds and the free press is freeing many minds as you know.",
            "recommendations": 7,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828956,
            "user_id": 62328700,
            "comment_title": "<br\\//>",
            "comment_body": "Calling Assange a 'journalist' is an insult to the entire profession and, indeed to the entire concept of a free press. This is vainglorious man who is only guided by his own ego. Not only did he hep get Trump into the White House, he also committed the ultimate crime of any h=journalist: giving up the clear real names of the people who helped his organization gather information in authoritarian regimes and war zones. How many of these people were killed, detained and tortured we don't know and Assange certainly doesn't care.",
            "recommendations": 24,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828977,
            "user_id": 61339302,
            "comment_title": "<br\\//>",
            "comment_body": "I am much more concerned with the Senator of Arizona “telling” a respected CNN reporter that he’s doesn’t have to answer to a liberal newsroom, and that Mike Pompeo feels he doesn’t have to answer to questions from a respected NPR interviewer.\n\nFirst, it’s irrelevant whether CNN has a liberal newsroom, the Senator still needs to answer to ALL reporters; she can’t pick and choose who to answer. That becomes propaganda, which is exactly what Trump does with Fox.\n\nSecond, Mike Pompeo is borrowing the recipe from authoritarian regimes, which is also a common thread from Trump. Dehumanize. Call them liars, call them fake, make them second class, let NOR defend itself. Fox News viewers will be bombastes with Pompeo calling NPR fake news. But will never broadcast NPR’s defense calling Pompeo a liar.",
            "recommendations": 33,
            "reply_count": 4
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829001,
            "user_id": 31638827,
            "comment_title": "<br\\//>",
            "comment_body": "Some of the commenters here don't get it. It doesn't matter whether you don't like the journalist's personality. What's important is whether they report the truth. And in response to trudds of sierra madre, CA, many if not most journalists actively choose sides. A recent case--look at all the reporters who repeated the government's lies about WMDs and beat the drums for the Iraq War.",
            "recommendations": 42,
            "reply_count": 4
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829066,
            "user_id": 84668946,
            "comment_title": "<br\\//>",
            "comment_body": "The 35 year old draconian law titled, the Computer Fraud and Abuse Act, is purposely vague. The key parts which are used to prosecute journalists are prohibitions on accessing a computer “without authorization” and “exceeding” authorized access. The vagueness allows for the government to catch journalists on minor violations & charge them with serious federal crimes. For instance, a journalist used someone else's network, even if he was a totally legitimate or invited user, but happened to violate one of the terms of service, employee policy or contract while using the network. In 2016, Matthew Keyes was arrested for passing along log in information to the organization, \"Anonymous.\"  In 2013 Aaron Swartz was charged with breaking a University computer system's terms of agreement & was charged with the federal Computer Fraud & Abuse law & sentenced to 50 years in jail although hung himself before being imprisoned.\n\nTo me, Edward Snowden is a huge hero who gave up a $300,000 year contracting job while living in Hawaii to share his inside information revealing what the NSA was gathering from everyday citizens as well as other seemingly abuses of power. Julian Assange assisted Snowden & Manning to share their secrets via the WIkiLeaks conduit. It's unfortunate that both Assange & Glenn Greenwald became Russian tools who were used to ultimately manipulate the US election. Both continue to minimize Russia's role, which leaves me less sympathetic to their current situations.",
            "recommendations": 3,
            "reply_count": 2
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829087,
            "user_id": 7653750,
            "comment_title": "<br\\//>",
            "comment_body": "And pompous Pompeo took a giant leap in the same direction with Mary Louise Kelly of NPR this week.",
            "recommendations": 24,
            "reply_count": 4
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829334,
            "user_id": 67847062,
            "comment_title": "<br\\//>",
            "comment_body": "Fascism: \"A political philosophy, movement, or regime...that exalts nation and often race above the individual and that stands for a centralized autocratic government headed by a dictatorial leader, severe economic and social regimentation, and forcible suppression of opposition.\" (Webster's Collegiate)\nTrump is a fascist. I do wish the Times would begin to acknowledge that.  \n\"I can do anything I want to do.\"\nHis \"Justice\" Dept. argues he can murder a citizen without any sanction.  \nIt and he argue as well that Congress may exercise no legitimate oversight of the president.\nDictionaries aside, our own experience should make clear what has happened in this country.",
            "recommendations": 70,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829337,
            "user_id": 66788641,
            "comment_title": "<br\\//>",
            "comment_body": "People who think that all fighting back has to be handled at 400 decibels could learn something from Mary Louise Kelly: she didn’t yell herself, she didn’t smack Pompeo right in his fat chops, she didn’t throw a fit. \n\nShe simply waited until he ran out of gas, got right on the air, and told the story. Thus prompting even more hysteria from Pompeo and others, which is something Americans need to know about. \n\nShe also didn’t act like Assange. Greenwald I can sympathize with, and see his point of view...but Assange? No. Fundamentally, Assange is no better than Pompeo, and would act the same if he got the chance.",
            "recommendations": 13,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829347,
            "user_id": 67162062,
            "comment_title": "<br\\//>",
            "comment_body": "If and when Assange is extradited to the US and tried in court he should receive the same considerations as Manning..assuming he cooperates. He has been hero and villain to both sides of the political divide. His knowledge could clear up once and for all political controversy of events leading up 2016 elections.",
            "recommendations": 1,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829289,
            "user_id": 61986282,
            "comment_title": "<br\\//>",
            "comment_body": "I get little pleasure from this, but :  I TOLD YOU SO.  Pompeo is the greatest threat to a free press in OUR Country. Why ?  Unlike most Trumpers, he is very intelligent and ruthless. He was our Congressperson, I know his “ work “ and showmanship very well. He has Trumps ear, and will stop at nothing to complete his own desires, and plans.  The stars are aligned for a Pompeo Presidential bid in 2024. He’s hedging his bets, with an extreme show of loyalty to Trump, but a plan to hedge his bets, when Trump implodes. \n   His greatest enemy is NOT Democrats, but a free and truthful press. You can run, Mike. Perhaps all the way back to Kansas. \nBut, you can’t hide forever. Even IN Kansas.",
            "recommendations": 113,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829046,
            "user_id": 50176648,
            "comment_title": "<br\\//>",
            "comment_body": "The existence of such statutes always creates the implied threat of expansion and misuse. These cases are distinguishable though, particularly given the rather personal quality of the Brazilian prosecution and the fact that Greenwald is actually a journalist. He would never have been brought up on Espionage Act charges on these facts in the US. The usual tendency to see Trump as the proverbial unmoved mover in all that's malign doesn't help the argument here.",
            "recommendations": 2,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104829025,
            "user_id": 58467593,
            "comment_title": "<br\\//>",
            "comment_body": "After a complete social, cultural, and political breakdown, many countries find it necessary to establish a “Truth Commission” to sift through an era, and restore integrity.\n\nI don’t think even impeaching Trump and removing him from office would be enough.\n\nWe will need an American Truth Commission to weigh the Trump era in the balance, and restore our society—including our Constitutionally guaranteed free press—to full integrity.",
            "recommendations": 38,
            "reply_count": 4
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828474,
            "user_id": 85829106,
            "comment_title": "<br\\//>",
            "comment_body": "Thank you for this much needed article. But I’m disappointed that you let the Bush and Obama administrations off so lightly, especially Obama. Obama was extremely consistent in using the Espionage Act more than all other presidents combined. \n\nWhy let Obama off so lightly?",
            "recommendations": 73,
            "reply_count": 4
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828551,
            "user_id": 50506373,
            "comment_title": "<br\\//>",
            "comment_body": "Julian Assange? I hope reporters always have complete freedom and protection to uncover and distribute the truth, but when a \"journalist\" actively chooses sides and selectively releases information? \nThis posterchild doesn't seem much more a model of a free press than Mike Pompeo.",
            "recommendations": 61,
            "reply_count": 5
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828744,
            "user_id": 71881345,
            "comment_title": "<br\\//>",
            "comment_body": "Julian Assange was and remains an egomaniacal glory seeking buffoon whose efforts to smear Hillary Clinton gave us Donald Trump. He remained sequestered in the London embassy of Ecuador while his sycophant Chelsea Manning took the fall. What admirable characteristics does he possess?\n\nGlenn Greenwald thinks that Edward Snowden, who committed acts of espionage against his country and later fled to Russia is only misunderstood. How a 29 year old person can have the chutzpah to think that he knew what was best for our nation beggars belief.\n\nPlease tell Mr. Risen that both Assange and Greenwald deserve what they have coming to them.",
            "recommendations": 19,
            "reply_count": 6
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828747,
            "user_id": 85435430,
            "comment_title": "<br\\//>",
            "comment_body": "I suspect the anti-journalist program originates here from official conduct. If the wave against journalism is so widespread, there must be an underlying strategy of clamping down on freedom. The story yesterday of the NPR reporter being yelled at by Pompeo was very telling. It indicates that the Republicans are either accustomed to journalist's taking orders, in that the expectation of service reveals an unacknowledged fact that some do. Beyond fake news from journalists, it seems the idea of fake news originating from the government is finally being revealed. Pompeo's agitation belied the expectation.\n\nThe fact is, the government spreads fake news and the attacks on journalists is preemptive diversionary brainwashing. I learned early on, people always believe the first story told, meaning the governments are spreading the false story claiming stories are false Ask why courtroom prosecutors always present a case first and most people are convicted.\n\nI have practical experience incurring the wrath of government falsehoods and lying. They have portrayed me as a villain to preemptively destroy me so no one cares, even joins in on the gauntlet. Republicans are nothing more than a lynch mob.",
            "recommendations": 17,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828540,
            "user_id": 22662096,
            "comment_title": "<br\\//>",
            "comment_body": "This will become \"and then they came for me\" for mainstream journalists.  They are hoping that they won't be targeted as long as they don't have difficult or combative personalities (which some folks claim is true of Assange and Greenwald).  But look at how fiercely Pompeo attacked the milquetoast NPR this week for daring to call him on his lies.  It's only going to get worse for the free press and the First Amendment as the US slides toward authoritarianism.",
            "recommendations": 202,
            "reply_count": 5
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828529,
            "user_id": 108320923,
            "comment_title": "<br\\//>",
            "comment_body": "\"Last April, the Justice Department charged Mr. Assange with aiding a source ... to gain access to a United States military computer database.\"\n\nTo put it more bluntly, Assange is charged with aiding password cracking, which is a crime.\n\n\"Both cases are based in part on a new prosecutorial concept — that journalism can be proved to be a crime through a focus on interactions between reporters and their sources.\"\n\nThat's pure obfuscation. The \"concept\" is that journalists cannot commit a crime or conspire to commit a crime. The Assange case is analogous to a journalist supplying breaking-and-entering tools to a source.\n\n\"Mr. Greenwald ... doesn’t believe that Mr. Bolsonaro would have taken action against an American journalist if he had thought President Trump would oppose it.\"\n\nSo Greenwald is blaming Trump for his predicament. Risen should instead be focusing on what Brazilian law says and what Greenwald actually did.",
            "recommendations": 13,
            "reply_count": 1
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828505,
            "user_id": 234516,
            "comment_title": "<br\\//>",
            "comment_body": "I admire Glenn Greenwald, particularly for his work with Snowden, and worry about his (and his family's) safety.  \n\nI would urge him and his family to move back to the US, but as James Risen notes, it is getting as bad here for journalists as it is in other parts of the world.  Just look at what Pompeo did to the NPR reporter -- I can see the Trump administration shutting down NPR as one of its next goals.  \n\nI'm not sure what the solution is, other than supporting journalists anyway we can, and voting all of the Republicans out of power.  But if Trump is not convicted by the Senate and is free to continue to interfere with our elections, even the ballot box may not be open to us as a remedy.  Scary times for all of us.",
            "recommendations": 81,
            "reply_count": 3
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828319,
            "user_id": 64537374,
            "comment_title": "<br\\//>",
            "comment_body": "Current governments serve the people. The people here are those in power and with money. All others are human capital to be used and disposed of when worn out. \n\nIn the old days it was called slavery. Today most recruiters, of which I have been and still recruit on occasion, call these tools \"human capital\". Just look on the job boards. They don't hide that fact. It's simply a matter of not reading what the words actually mean. \nI believe Orwell and Witttgenstein had more to say on the matter\nof language.",
            "recommendations": 10,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828370,
            "user_id": 38319040,
            "comment_title": "<br\\//>",
            "comment_body": "“Trump-like attacks on the press are spreading like a virus around the globe.” \nFreedom of the press is one of the most important aspects of a democracy. We must defend it at all costs! Here and around the world.",
            "recommendations": 59,
            "reply_count": 0
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828389,
            "user_id": 5306868,
            "comment_title": "<br\\//>",
            "comment_body": "No secret here.  My first thought upon reading about Secretary of State Pompeo's rant against the NPR journalist was \"Fascism has arrived in the US.\"  Whenever a public servant feels that they can rebuke a legitimate journalist, the press is in trouble.",
            "recommendations": 186,
            "reply_count": 10
        },
        {
            "article_url": "https://www.nytimes.com/2020/01/26/opinion/greenwald-brazil-reporter.html",
            "comment_id": 104828394,
            "user_id": 60773215,
            "comment_title": "<br\\//>",
            "comment_body": "We all want to believe that our species is moving in a straight line from darkness into light economically, socially and otherwise.  The truth is quite the opposite.\n\nEgyptians, Mayans and other civilizations built magnificent structures and led orderly societies long before the Dark Ages.  There were the exciting, technology driven late 1800's then two World Wars and the rise and (mostly) fall of Nazism.  \n\nOne can speculate where all of this I going, but unless those of us interested in the rule of law and freedom of individuals to practice free speech in a Democracy stay alert, we are going nowhere good.",
            "recommendations": 34,
            "reply_count": 0
        }
    ]
}